In [2]:
import pandas as pd

In [22]:
cars2 = [
    {
        "vehicleid" : "a",
        "make" : "Audi",
        "model" : "A8",
        "year" : 2007,
        "price" : 85200,
        "miles" : 120000,
    },
     {
        "vehicleid" : "b",
        "make" : "Honda",
        "model" : "Civic",
        "year" : 2001,
        "miles" : 85000,
        "resale" : 6000,
    },
     {
        "vehicleid" : "e",
        "make" : "Honda",
        "model" : "Fit",
        "year" : 2001,
        "price" : 25200,
        "miles" : 85000,
        "resale" : 6000,
    },
     {
        "vehicleid" : "c",
        "make" : "Infinity",
        "model" : "q50",
        "year":2017 ,
        "price": 22000,
        "miles" : 25000,
         "resale": 15000,
    },
     {
        "vehicleid": "d",
        "make": "Tesla" ,
        "model" : "x",
        "year": 2021,
        "price": 114000 ,
        "miles" : 2000 ,
    },
]
df = pd.DataFrame(cars2)
df

  vehicleid      make  model  year     price   miles   resale
0         a      Audi     A8  2007   85200.0  120000      NaN
1         b     Honda  Civic  2001       NaN   85000   6000.0
2         e     Honda    Fit  2001   25200.0   85000   6000.0
3         c  Infinity    q50  2017   22000.0   25000  15000.0
4         d     Tesla      x  2021  114000.0    2000      NaN

In [9]:
df = df.set_index("vehicleid")
df

               make  model  year   price   miles
vehicleid
a              Audi     A8  2007   85200  120000
b             Honda  Civic  2001   16000   85000
c          Infinity    q50  2017   22000   25000
d             Tesla      x  2021  114000    2000

In [10]:
civic = df.loc["b"]
civic

make     Honda
model    Civic
year      2001
price    16000
miles    85000
Name: b, dtype: object

In [8]:
first_car = df.iloc[1]
first_car

vehicleid        b
make         Honda
model        Civic
year          2001
price        16000
miles        85000
Name: 1, dtype: object

In [11]:
complete_df = df.dropna()
complete_df

               make  model  year   price   miles
vehicleid
a              Audi     A8  2007   85200  120000
b             Honda  Civic  2001   16000   85000
c          Infinity    q50  2017   22000   25000
d             Tesla      x  2021  114000    2000

In [16]:
completed_df = df.dropna(subset = ["resale","price"])
completed_df

  vehicleid      make model  year    price  miles   resale
2         c  Infinity   q50  2017  22000.0  25000  15000.0

In [17]:
df.describe()

              year          price          miles        resale
count     4.000000       3.000000       4.000000      2.000000
mean   2011.500000   73733.333333   58000.000000  10500.000000
std       9.146948   47059.678424   54154.101107   6363.961031
min    2001.000000   22000.000000    2000.000000   6000.000000
25%    2005.500000   53600.000000   19250.000000   8250.000000
50%    2012.000000   85200.000000   55000.000000  10500.000000
75%    2018.000000   99600.000000   93750.000000  12750.000000
max    2021.000000  114000.000000  120000.000000  15000.000000

In [18]:
df["price"].max()

114000.0

In [19]:
df["price"].mean()

73733.33333333333

In [20]:
df["price"].sum()

221200.0

In [23]:
df["make"].value_counts()

Honda       2
Tesla       1
Audi        1
Infinity    1
Name: make, dtype: int64

In [24]:
df["make"].unique()

array(['Audi', 'Honda', 'Infinity', 'Tesla'], dtype=object)

In [25]:
df.columns

Index(['vehicleid', 'make', 'model', 'year', 'price', 'miles', 'resale'], dtype='object')

In [29]:
make_model_df = df[["vehicleid","make", "model"]]
make_model_df = make_model_df.rename(columns={"make":"Manufacturer","vehicleid": "Vehicle ID", "model":"Model"})
make_model_df.set_index("Vehicle ID")
make_model_df

  Vehicle ID Manufacturer  Model
0          a         Audi     A8
1          b        Honda  Civic
2          e        Honda    Fit
3          c     Infinity    q50
4          d        Tesla      x

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   vehicleid  5 non-null      object
 1   make       5 non-null      object
 2   model      5 non-null      object
 3   year       5 non-null      int64
 4   price      4 non-null      float64
 5   miles      5 non-null      int64
 6   resale     3 non-null      float64
dtypes: float64(2), int64(2), object(3)
memory usage: 408.0+ bytes